import { Container, Box, Typography, Grid } from "@mui/material";

const About = (props) => {
    return(
        <Container>
            <Box>
                <Typography
                    variant="h4"
                    component="h1"
                    sx={{mt: 3, mb: 2}}
                >О чем сериал конец гребаного мира</Typography>
                <Grid conatiner>
                    <img
                        className="image-full-screen"
                        src="https://www.film.ru/sites/default/files/images/The%20End%20of%20the%20Fing%20World.jpg"
                    />
                </Grid>
                <Typography
                    variant="body1"
                    sx={{mt:3}}
                >«Конец ***го мира» (англ. The End of the F***ing World) — британский телевизионный сериал, 
                сочетающий жанры драмы, чёрной комедии и дорожного кино. Все восемь серий первого сезона были 
                показаны 24 октября 2017 года на канале Channel 4, а также были доступны на сервисе All 4. Американская 
                компания Netflix начала международное распространение сериала в конце 2017 года. Премьера второго 
                сезона состоялась 5 ноября 2019 года. Сюжет первого сезона основан на одноимённом комиксе Чарльза 
                Форсмана.</Typography>
                <Typography
                    variant="h6"
                    componennt="h3"
                    sx={{mt:3,mb:1}}
                >1 Сезон</Typography>
                <Typography
                    variant="body1"
                >В центре сюжета пара подростков с непростыми характерами — Джеймс и Алисса. Обоим по семнадцать 
                лет. Джеймс — замкнутый из-за увиденного в детстве суицида матери юноша, который считает себя психопатом 
                и давно мечтает перейти от убийств мелких зверьков к убийству человека. Алисса — капризная бунтарка, 
                которая чувствует себя лишней в новой семье матери и стремится отыскать бросившего её много лет назад отца. 
                Они знакомятся в школе и вместе сбегают на машине отца Джеймса. Джеймс прихватывает с собой нож, которым при 
                случае надеется убить Алиссу. Вскоре машина ломается, и парочка забирается в пустующим дом, хозяин которого, 
                профессор и писатель Клайв Кох, оказывается насильником. Когда он набрасывается на Алиссу, Джеймс убивает его 
                ножом. Они продолжают двигаться туда, где живёт отец Алиссы, но теперь по их следу пускается пара женщин-детективов. 
                По дороге подростки угоняют ещё одну машину и устраивают потасовку на заправке, когда её владелица хочет их 
                задержать. Под влиянием Алиссы Джеймс постепенно меняется; в одной из серий, сидя в полицейском участке, он 
                думает, что больше не хочет быть психопатом.</Typography>
                <Typography
                    variant="body1"
                    sx={{mt:2}}
                >Когда Алисса находит отца в домике на побережье, они оба радуются встрече друг с другом. Однако вскоре оказывается,
                 что её отец наркоторговец и к тому же бросил ещё одну семью, оставив маленького сына. Джеймс понимает, 
                 что происшествие на автостоянке попало на видеокамеры и их скоро найдут. Парочка решает уплыть на катере 
                 отца Алиссы, однако не успевает. Одна из полицейских приходит в дом к Алиссе, уговаривая Джеймса сдаться,
                  потому что в этот день ему исполняется 18 лет и в случае сопротивления ему будет хуже. Понимая, что
                   задержание рано или поздно случится, Джеймс решает выставить себя похитителем Алиссы, взяв всю вину 
                   на себя. Он хватает обрез отца Алиссы и убегает по берегу моря от преследующей его полиции. Последней
                    его мыслью становится: «Сегодня мне 18, и думаю, я теперь понимаю, что люди значат друг для друга». 
                    После этого экран затемняется и слышится выстрел.</Typography>

                <Typography
                    variant="h6"
                    componennt="h3"
                    sx={{mt:3,mb:1}}
                >2 Сезон</Typography>
                <Typography
                    variant="body1"
                >Действия второго сезона происходят два года спустя. Джеймс выжил, хотя долго пролежал в больнице и стал хромать; суд признал его невиновным в убийстве, учитывая обстоятельства дела. По просьбе матери Алиссы Джеймс пишет ей письмо, где говорит, что больше не хочет её видеть. Его отец внезапно умирает от сердечного приступа, и Джеймс начинает жить в своей машине. Когда он получает письмо с пулей, на которой нацарапано его имя, он начинает подозревать, что Алиссе может грозить опасность, и едет разыскивать её. Алисса же с матерью переселяется в глубинку, где работает в кафе у своей тёти. Она знакомится с местным парнем и собирается выйти за него замуж. Между тем параллельно разворачивается история Бонни, одной из девушек, которых приводил к себе домой Кох. Уверенная в том, что Кох любит её, она из ревности насмерть сбивает другую девушку, увиденную в его доме, и затем садится в тюрьму. Выйдя из тюрьмы, она узнаёт, что Кох был убит Джеймсом и Алиссой, посылает им пули с их именами и отправляется на их поиски, чтобы их убить.</Typography>
                <Typography
                    variant="body1"
                    sx={{mt:2}}
                >Хотя Алисса успевает выйти замуж, в тот же день она уезжает с Джеймсом, а по дороге они подбирают Бонни, которая якобы путешествует автостопом. Бонни ждёт удобного момента, чтобы убить своих врагов. Троица останавливается в мотеле, где Бонни случайно убивает пристающего к ней хозяина и сама получает ранение. Алисса пытается разобраться в своих чувствах и возвращается домой. Хоть её муж прощает Алиссу, она просит расторгнуть брак. Джеймс видит, как Бонни с пистолетом заходит в кафе и понимает, что та хочет убить Алиссу. Когда Бонни направляет пистолет на Джеймса и Алиссу, Алисса признаётся, что до сих пор не может оправиться от пережитого в доме Коха. Не до конца веря в то, что Кох был насильником, Бонни пытается покончить с собой, но Джеймс и Алисса останавливают её. Чтобы преодолеть душевную травму, Алисса снова возвращается в дом Коха, который теперь пуст и выставлен на продажу. Затем Алисса и Джеймс уезжают и развеивают прах отца Джеймса. В конце они признаются друг другу в любви и Алисса говорит, что ей понадобится время, чтобы изменить свою жизнь.</Typography>
            </Box>
        </Container>
    )
}

export default About;